/*
 * PROGRAM ID   : Line.c
 * PROGRAM NAME : Line 모듈
 * AUTHOR       : (주)ICA
 * COMMENT      : Line 모듈
 * HISTORY      : 2013.09.30 강석. 최초작성
 *
 */

#include <Common.h>

/*============================================================================*/
/*
 * define constant
 */
/*----------------------------------------------------------------------------*/

/*============================================================================*/
/*
 * global variables
 */
/*----------------------------------------------------------------------------*/

/*============================================================================*/
/*
 * 내용 : 순차적인 값을 리턴한다.
 */
/*----------------------------------------------------------------------------*/
int LineGetSeq( )
/*----------------------------------------------------------------------------*/
{
	BOOL flag = TRUE;
	
	static int iSeq = 0;
	int ret;
	
	if (flag) {
		ret = iSeq;
		iSeq ++;
	}
	
	return ret;
}
/******************************************************************************/
/******************************************************************************/
/******************************************************************************/
/******************************************************************************/
/******************************************************************************/

#ifdef _EXE

/*============================================================================*/
/*
 * 위에서 정의한 함수를 테스트 한다.
 */
/*----------------------------------------------------------------------------*/
main(int argc, char* argv[])
/*----------------------------------------------------------------------------*/
{
	BOOL flag = TRUE;
	
	sProgName = argv[0];
	
	if (flag) LOG(_FL_, 0, 0, "\x1b[44m< %s >\x1b[0m", sProgName);

	if (flag)
	{
		if (flag) strcpy(sServiceid, "OXASHC0101");
		if (flag) strcpy(sServiceid, "OXATAT0101");

		/*
		 * master 환경파일을 읽는다. biz.properties 파일도 읽는다.
		 */
		/* if (CfgMst() < 0) */
		if (CfgMaster() < 0)
		{
			printf("ERROR : get config....\n");
			exit(9);
		}

		CfgOxa();
		
		if (flag)
		{
			LOG(_FL_, 0, 0,  "[SERVICEID ] 서비스ID          = [%s]", CfgGetOxa("SERVICEID" ));
			LOG(_FL_, 0, 0,  "[CONN_TYPE ] 접속형태          = [%s]", CfgGetOxa("CONN_TYPE" ));
			LOG(_FL_, 0, 0,  "[CONN_TRY  ] 접속시도          = [%s]", CfgGetOxa("CONN_TRY"  ));
			LOG(_FL_, 0, 0,  "[CONN_INFO ] 접속서버정보      = [%s]", CfgGetOxa("CONN_INFO" ));
			LOG(_FL_, 0, 0,  "[LENGTH_LEN] 길이필드크기      = [%s]", CfgGetOxa("LENGTH_LEN"));
			LOG(_FL_, 0, 0,  "[INC_LEN   ] 길이필드포함크기  = [%s]", CfgGetOxa("INC_LEN"   ));
			LOG(_FL_, 0, 0,  "[SVC_DESC  ] 서비스 설명       = [%s]", CfgGetOxa("SVC_DESC"  ));
		}
	}

	if (!flag)   /* DATE.2013.09.30 */
	{
		LOG(_FL_, 0, 0, "[%d]", LineGetSeq());
		LOG(_FL_, 0, 0, "[%d]", LineGetSeq());
		LOG(_FL_, 0, 0, "[%d]", LineGetSeq());		
	}
}

#endif
