/*
 * PROGRAM ID   : Flck.h
 * PROGRAM NAME : 파일 잠금에 사용되는 함수들 정의
 * AUTHOR       : (주)ICA
 * COMMENT      : 파일 잠금에 사용하는 함수들을 선언한다.
 * HISTORY      : 2013.07.24 강석. 최초작성
 *
 */

#ifndef _FLCK_H_
#define _FLCK_H_

/*============================================================================*/
/*
 * define constant
 */
/*----------------------------------------------------------------------------*/

/*============================================================================*/
/*
 * global variables
 */
/*----------------------------------------------------------------------------*/

/*============================================================================*/
/*
 * decleration
 */
/*----------------------------------------------------------------------------*/

int FlckFcntl   ( FLCK_FCNTL* flck );
int FlckLock    ( int fd, int start, int len );
int FlckLockWait( int fd, int start, int len );
int FlckUnlock  ( int fd );


#endif
