/*
 * PROGRAM ID   : Mmap.h
 * PROGRAM NAME : mmap 처리를 위해 사용하는 모듈 헤더
 * AUTHOR       : (주)ICA
 * COMMENT      : mmap 처리를 위해 사용하는 모듈 헤더
 * HISTORY      : 2013.07.24 강석. 최초작성
 *
 */

#ifndef _MMAP_H_
#define _MMAP_H_

/*============================================================================*/
/*
 * define constant
 */
/*----------------------------------------------------------------------------*/

/*============================================================================*/
/*
 * global variables
 */
/*----------------------------------------------------------------------------*/


/*============================================================================*/
/*
 * decleration
 */
/*----------------------------------------------------------------------------*/

char* MmapCreate(const char* sFileName, const int iSize);
char* MmapOpen(const char* sFileName, const int iSize);
BOOL MmapSync(void* pMap, int iSize);


#endif


