/*
 * PROGRAM ID   : Seq.h
 * PROGRAM NAME : Seq 변수 헤더
 * AUTHOR       : (주)ICA
 * COMMENT      : Seq 변수 헤더
 * HISTORY      : 2013.08.10 강석. 최초작성
 *
 */

#ifndef _SEQ_H_
#define _SEQ_H_

/*============================================================================*/
/*
 * define constant
 */
/*----------------------------------------------------------------------------*/

#define   SEQ_MAX_REC   100

/*============================================================================*/
/*
 * global variables
 */
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/*
 *  Sequence 관리 Mmap 구조
 *
 *  예) YKBB0101    122432\n
 *
 */
typedef struct _SEQ_REC_
{
	char    sFlag     [   1];  /* 사용 Flag Y/N  */
	char    sFepid    [   5];  /* 관련 FEPID     */
	char    sSvcNo    [   2];  /* 관련 SVCNO     */
	char    sSeqNo    [  10];  /* Sequence 번호  */
	char    sCrLf     [   1];  /* CrLf('\n')     */
} SEQ_REC;


/*============================================================================*/
/*
 * decleration
 */
/*----------------------------------------------------------------------------*/

int SeqGetNo(char* sFepid);


#endif


