/*
 * PROGRAM ID   : Var.h
 * PROGRAM NAME : 글로벌 변수 헤더
 * AUTHOR       : (주)ICA
 * COMMENT      : 공통적으로 사용하는 글로벌 변수 헤더
 * HISTORY      : 2013.07.24 강석. 최초작성
 *
 */

#ifndef _VAR_H_
#define _VAR_H_

/*============================================================================*/
/*
 * define constant
 */
/*----------------------------------------------------------------------------*/

/*============================================================================*/
/*
 * global variables
 */
/*----------------------------------------------------------------------------*/
extern char*    sProgName               ;

extern char     sSpace          [   1+1];                  /* I:Internal, X:External */
extern char     sFepid          [   5+1];
extern char     sServiceid      [  10+1];
extern char     sApNo           [   2+1];                  /* Ap server Number */

extern char     sDummy          [ 100+1];


/*============================================================================*/
/*
 * decleration
 */
/*----------------------------------------------------------------------------*/

#endif


